# day17

In [5]:
import pandas as pd

In [31]:
list1 = [ [1,2,3],[4,5,6],[7,8,9] ]

In [32]:
df = pd.DataFrame(list1, columns=["A","B","C"])

In [33]:
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [34]:
v=df.at[2,"C"]

In [35]:
v

9

In [37]:
df.at[2,"C"] = 10

In [38]:
df

   A  B   C
0  1  2   3
1  4  5   6
2  7  8  10

In [41]:
df2 = pd.DataFrame({"names": ["Jhon","Mery","Peter"],"age": [27, 34,47], "sex": ["male","female","female"]})

In [42]:
df2

   names  age     sex
0   Jhon   27    male
1   Mery   34  female
2  Peter   47  female

In [43]:
df2.loc[0,"age"]

27

In [45]:
df2.loc[2,"sex"] = "male"